
# tap repositories and their packages

tap 'homebrew/core'
brew 'arpack'
brew 'autoconf'
brew 'cairo'
brew 'docker'
brew 'epstool'
brew 'fftw'
brew 'fig2dev'
brew 'flac'
brew 'fltk'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'ghostscript'
brew 'ghq'
brew 'git'
brew 'git-flow'
brew 'gl2ps'
brew 'glib'
brew 'glpk'
brew 'gmp'
brew 'gnuplot'
brew 'go'
brew 'gobject-introspection'
brew 'graphicsmagick'
brew 'graphite2'
brew 'harfbuzz'
brew 'haskell-stack'
brew 'hdf5'
brew 'icu4c'
brew 'imagemagick'
brew 'isl'
brew 'jasper'
brew 'jenv'
brew 'jpeg'
brew 'jq'
brew 'libevent'
brew 'libffi'
brew 'libmpc'
brew 'libogg'
brew 'libpng'
brew 'libsndfile'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'little-cms2'
brew 'lua'
brew 'mas'
brew 'maven'
brew 'mecab'
brew 'mecab-ipadic'
brew 'metis'
brew 'mpfr'
brew 'netpbm'
brew 'octave'
brew 'oniguruma'
brew 'open-mpi'
brew 'openjpeg'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'peco'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'portaudio'
brew 'postgresql'
brew 'pstoedit'
brew 'pyenv'
brew 'qhull'
brew 'qrupdate'
brew 'readline'
brew 'socat'
brew 'suite-sparse'
brew 'sundials'
brew 'szip'
brew 'texinfo'
brew 'tomcat'
brew 'tree'
brew 'veclibfort'
brew 'webp'
brew 'xz'
brew 'zplug'
brew 'zsh'

tap 'caskroom/cask'

tap 'caskroom/fonts'

tap 'caskroom/versions'

tap 'mscharley/homebrew'
brew 'alacritty'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sanemat/font'
brew 'ricty'

# Other Cask applications
cask '5kplayer'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'boostnote'
cask 'caffeine'
cask 'chromium'
cask 'clipy'
cask 'cmd-eikana'
cask 'docker'
cask 'dropbox'
cask 'eclipse-java'
cask 'enpass'
cask 'evernote'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'gfxcardstatus'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'insomniax'
cask 'iterm2'
cask 'java'
cask 'java8'
cask 'kindle'
cask 'macdown'
cask 'macvim'
cask 'night-owl'
cask 'onedrive'
cask 'oni'
cask 'opera'
cask 'plain-clip'
cask 'r-app'
cask 'rstudio'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'vagrant'
cask 'visual-studio-code'
cask 'xquartz'
