
# tap repositories and their packages

tap 'homebrew/core'
brew 'autoconf'
brew 'cairo'
brew 'docker'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'fribidi'
brew 'gdbm'
brew 'gettext'
brew 'ghq'
brew 'git'
brew 'glib'
brew 'go'
brew 'gobject-introspection'
brew 'graphite2'
brew 'harfbuzz'
brew 'haskell-stack'
brew 'icu4c'
brew 'jenv'
brew 'jpeg'
brew 'jq'
brew 'libffi'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'mas'
brew 'maven'
brew 'oniguruma'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'peco'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'pyenv'
brew 'readline'
brew 'tomcat'
brew 'tree'
brew 'zplug'
brew 'zsh'

tap 'caskroom/cask'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'boostnote'
cask 'caffeine'
cask 'clipy'
cask 'cmd-eikana'
cask 'docker'
cask 'dropbox'
cask 'eclipse-java'
cask 'enpass'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'gfxcardstatus'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'java'
cask 'macdown'
cask 'macvim'
cask 'night-owl'
cask 'onedrive'
cask 'opera'
cask 'plain-clip'
cask 'r-app'
cask 'rstudio'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'xquartz'

tap 'caskroom/fonts'
cask 'font-hack-nerd-font'

tap 'caskroom/versions'
cask 'java8'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sanemat/font'
brew 'ricty'

# App Store applications
#appstore '682658836 GarageBand (10.2.0)'
#appstore '408981434 iMovie (10.1.8)'
#appstore '409183694 Keynote (8.0)'
#appstore '539883307 LINE (5.7.0)'
#appstore '409203825 Numbers (5.0)'
#appstore '867299399 OmniFocus (2.12.1)'
#appstore '409201541 Pages (7.0)'
#appstore '415166115 Typist (2.4.0)'
#appstore '497799835 Xcode (9.2)'
